README.org
:PROPERTIES:
:header-args: :tangle no :results silent :padline no :comments link
:END:
#+TITLE: 加拉特隆
#+STARTUP: overview
#+PROPERTY: header-args:emacs-lisp :lexical yes :comments no

#+BEGIN_SRC emacs-lisp :tangle galactron.el :noweb yes
<<package-header>>
#+END_SRC

终止所有纷争，重塑整个世界。

#+BEGIN_SRC emacs-lisp :tangle galactron.el :comments org
;;; Code:
#+END_SRC

* 安装
:PROPERTIES:
:VISIBILITY: children
:END:

在下面这个代码块，按 ~C-c C-c~ 即可安装。需要重启Emacs才会生效

#+BEGIN_SRC emacs-lisp
(let (org-confirm-babel-evaluate) (org-babel-tangle))
(package-install-file (file-name-directory buffer-file-name))
(let ((dirname (package-desc-dir
                (car (assoc-default 'galactron package-alist)))))
  (dolist (name '("epdfinfo" "evpdfinfo"))
    (copy-file name (file-name-concat dirname name) t)))
(restart-emacs)
#+END_SRC

** 停用[[elisp:(customize-group 'galactron)][Galactron]]设置
:PROPERTIES:
:header-args:emacs-lisp: :tangle galactron.el :comments link
:END:

所有Galactron自带的设置都可以在Custom里关闭

#+BEGIN_SRC emacs-lisp
;;;###autoload(defgroup galactron nil "在启动时用Galactron配置Emacs" :tag "Galactron" :prefix "galactron-" :group 'emacs)
#+END_SRC

也可以一次[[elisp:(customize-group 'galactron-group)][停用一组设置]]，这样直接就不加载那个文件了。

#+BEGIN_SRC emacs-lisp
;;;###autoload(defgroup galactron-group nil "启用或停用一组Galactron设置" :prefix "galactron-group-" :group 'galactron)
#+END_SRC

** Org配置文件

建议在所有Org配置文件一开始就加上

#+BEGIN_SRC org
,#+PROPERTY: header-args:emacs-lisp :lexical yes :results silent

,#+BEGIN_SRC emacs-lisp
;;; -*- lexical-binding: t; -*-
,#+END_SRC
#+END_SRC

*** dotemacs.org

建议在Org目录下放一下dotemacs.org，把这个文件的路径加到[[help:galactron-init-files][galactron-init-files]]，其他所有文件，比如Capture Target和Agenda File都在这里面用[[help:galactron-load-file][galactron-load-file]]加载。

#+BEGIN_SRC org
,#+BEGIN_SRC emacs-lisp :var directory-name=(file-name-directory (buffer-file-name))
(galactron-default org-directory directory-name)
(galactron-load-file "my-config.org")
,#+END_SRC
#+END_SRC

*** Capture Target

如果一个文件中包含了Capture Target，可以在顶上写上。若设置了[[help:galactron-orb-enabled-capture][galactron-orb-enabled-capture]]，不用写。

#+BEGIN_SRC org
,#+BEGIN_SRC emacs-lisp :var targets=(galactron-capture-collect-targets)
(galactron-capture-define-targets targets)
,#+END_SRC
#+END_SRC

| 类型     | PROPERTY     |
|----------+--------------|
| 随手记   | CAPTURE_NOTE |
| 任务     | CAPTURE_TODO |
| 网页剪辑 | CAPTURE_CLIP |

比如，下面这样，可以在[[help:galactron-capture-note][galactron-capture-note]]时，输入til把目标选为这个heading

#+BEGIN_SRC org
:PROPERTIES:
:CAPTURE_NOTE: til
:END:
#+END_SRC

要分日期capture，可以写上 ~:CAPTURE_TARGET:~

#+BEGIN_SRC org
:PROPERTIES:
:CAPTURE_TARGET: til-%Y%m.org
:END:
#+END_SRC

要想在提示最前面加几个字符可以用 ~:CAPTURE_TITLE:~

#+BEGIN_SRC org
:PROPERTIES:
:CAPTURE_TITLE: 直到我膝盖中了一箭
:END:
#+END_SRC

*** Agenda File

要把一个Org文件加到[[elisp:(customize-option 'org-agenda-files)][org-agenda-files]]，可以直接在里面写。若设置了[[help:galactron-orb-enabled-capture][galactron-orb-enabled-capture]]，所有包含了 ~CAPTURE_TODO~ 的文件不用加。

#+BEGIN_SRC org
,#+BEGIN_SRC emacs-lisp
(galactron-agenda-add)
,#+END_SRC
#+END_SRC

** XDG Desktop

*** emacs-client

#+BEGIN_SRC emacs-lisp :tangle no
(let* ((commands (list "./xdg-util.py" "emacsclient"
                       (getenv "GIO_LAUNCHED_DESKTOP_FILE")))
       (cmds
        (if (equal (getenv "container") "flatpak")
            (append
             '("flatpak-spawn" "--host" "--watch-bus" "--")
             commands)
          commands))
       (cmd (car cmds))
       (args (cdr cmds)))
  (with-temp-buffer
    (let ((status (apply 'call-process cmd nil t nil args)))
      (if (zerop status)
          (message "\nOK\n%s" (buffer-string))
        (message "Error %s\n%s" status (buffer-string))))))
#+END_SRC

*** org-protocol

网页剪辑功能需要添加org-protocol

#+BEGIN_SRC emacs-lisp :tangle no
(let* ((commands (list "./xdg-util.py" "org-protocol"
                       (getenv "GIO_LAUNCHED_DESKTOP_FILE")))
       (cmds
        (if (equal (getenv "container") "flatpak")
            (append
             '("flatpak-spawn" "--host" "--watch-bus" "--")
             commands)
          commands))
       (cmd (car cmds))
       (args (cdr cmds)))
  (with-temp-buffer
    (let ((status (apply 'call-process cmd nil t nil args)))
      (if (zerop status)
          (message "\nOK\n%s" (buffer-string))
        (message "Error %s\n%s" status (buffer-string))))))
#+END_SRC

** 添加浏览器书签

网页剪辑功能需要在浏览器里加一个书签

#+BEGIN_EXAMPLE
javascript:location.href='org-protocol://capture?'+new URLSearchParams({url:location.href,title:document.title,body:Array.from({length:getSelection().rangeCount},(_,i)=>new XMLSerializer().serializeToString(getSelection().getRangeAt(i).cloneContents())).join()})
#+END_EXAMPLE

* Galactron自带设置
:PROPERTIES:
:VISIBILITY: content
:END:
** 调整默认设置
:PROPERTIES:
:VISIBILITY: content
:END:
*** [[elisp:(customize-group 'galactron-server)][Server]]
:PROPERTIES:
:header-args:emacs-lisp: :lexical yes :tangle galactron-server.el
:VISIBILITY: children
:END:

#+BEGIN_SRC emacs-lisp :noweb yes :comments no
<<module-header(name="server",desc="修改Server设置")>>
#+END_SRC

#+BEGIN_SRC emacs-lisp
(require 'server)
(unless (server-running-p)
  (server-start))
#+END_SRC

*** [[elisp:(customize-group 'galactron-package)][Package]]
:PROPERTIES:
:header-args:emacs-lisp: :lexical yes :tangle galactron-package.el
:VISIBILITY: children
:END:

#+BEGIN_SRC emacs-lisp :noweb yes :comments no
<<module-header(name="package",desc="修改Package Archive设置")>>
#+END_SRC

**** [[help:galactron-package-enabled-melpa][MELPA]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-package-enabled-melpa t
  "MELPA

- MELPA官方 Milkypostman's Emacs Lisp Package Archive
  https://melpa.org

- TUNA镜像 清华大学开源软件镜像站
  https://mirrors.tuna.tsinghua.edu.cn/help/elpa/

- SJTUG镜像 上海交通大学SJTUG软件源镜像服务
  https://mirrors.sjtug.sjtu.edu.cn/docs/emacs-elpa
"
  :type
  '(choice
    (const :tag "MELPA官方" t)
    (const :tag "TUNA镜像" tuna)
    (const :tag "SJTUG镜像" sjtug)
    (const :tag "禁用" nil))
  :tag "MELPA")

(when galactron-package-enabled-melpa
  (galactron-default-assoc
   package-archives
   "melpa"
   (pcase galactron-package-enabled-melpa
     ('tuna "http://mirrors.tuna.tsinghua.edu.cn/elpa/melpa/")
     ('sjtug "https://mirrors.sjtug.sjtu.edu.cn/emacs-elpa/melpa/")
     (_ "https://melpa.org/packages/"))))
#+END_SRC

**** [[help:galactron-package-enabled-hxb][我的美尔巴]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-package-enabled-hxb t
  "我的美尔巴 https://github.com/hxb2012/melpa/"
  :type 'boolean
  :tag "我的美尔巴")

(when galactron-package-enabled-hxb
  (galactron-default-assoc package-archives
                        "hxb" "https://hxb2012.github.io/melpa/")
  (galactron-default-assoc package-archive-priorities "hxb" 1))
#+END_SRC

*** [[elisp:(customize-group 'galactron-display)][显示]]
:PROPERTIES:
:header-args:emacs-lisp: :lexical yes :tangle galactron-display.el
:VISIBILITY: children
:END:

#+BEGIN_SRC emacs-lisp :noweb yes :comments no
<<module-header(name="display",desc="修改显示设置")>>
#+END_SRC

**** [[help:galactron-display-enabled-glyphless][不可见字符]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-glyphless t
  "不可见字符"
  :type 'boolean
  :tag "Glyphless")

(defun galactron-display--enable-glyphless-h ()
  (glyphless-display-mode t))

(when galactron-display-enabled-glyphless
  (dolist (hook
           '(ert-simple-view-mode-hook
             ert-results-mode-hook
             messages-buffer-mode-hook
             text-mode-hook
             prog-mode-hook))
    (add-hook hook 'galactron-display--enable-glyphless-h)))
#+END_SRC

**** [[help:galactron-display-enabled-whitespace][高亮显示空白]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-whitespace t
  "高亮显示空白"
  :type 'boolean
  :tag "Whitespace")

(defun galactron-display--enable-whitespace-h ()
  (whitespace-mode t))

(when galactron-display-enabled-whitespace
  (galactron-default whitespace-style
                  '(face tabs trailing indentation tab-mark))
  (dolist (hook
           '(text-mode-hook
             prog-mode-hook))
    (add-hook hook 'galactron-display--enable-whitespace-h)))
#+END_SRC

**** [[help:galactron-display-enabled-line-number][行号]]

~global-linum-mode~ 和 ~pdf-tools~ 冲突，参考[[https://github.com/politza/pdf-tools/issues/308#issuecomment-328217608][pdf-tools #308下的评论]]

Emacs 29参考[[https://emacs.stackexchange.com/a/78370][What to use instead of linum-mode in Emacs 29?]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-line-number t
  "行号"
  :type 'boolean
  :tag "Line number")

(defun galactron-display--enable-line-number-h ()
  (if (< emacs-major-version 29)
      (linum-mode t)
    (display-line-numbers-mode t)))

(when galactron-display-enabled-line-number
  (dolist (hook
           '(prog-mode-hook))
    (add-hook hook 'galactron-display--enable-line-number-h)))
#+END_SRC

**** [[help:galactron-display-enabled-word-wrap-by-category][中文折行]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-word-wrap-by-category t
  "中文折行"
  :type 'boolean
  :tag "Word wrap by category")

(when galactron-display-enabled-word-wrap-by-category
  (galactron-default word-wrap-by-category t))
#+END_SRC

**** [[help:galactron-display-enabled-visual-fill-column][按Fill Column折行]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-visual-fill-column t
  "按Fill Column折行"
  :type 'boolean
  :tag "Visual fill column")

(when galactron-display-enabled-visual-fill-column
  (galactron-with-package-installed visual-fill-column
    (add-hook 'visual-line-mode-hook #'visual-fill-column-mode)
    (advice-add 'text-scale-adjust :after #'visual-fill-column-adjust)
    (galactron-default visual-fill-column-center-text t)
    (galactron-default
     visual-fill-column-enable-sensible-window-split t)
    (galactron-default visual-line-fringe-indicators '(nil  t))
    (galactron-default
     visual-fill-column-fringes-outside-margins nil)))
#+END_SRC

**** [[help:galactron-display-enabled-font-setup][中英文字符等宽]] (仅支持Flatpak)

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-font-setup t
  "中英文字符等宽"
  :type 'boolean
  :tag "Font setup")

(defun galactron-display--font-setup-h ()
  (add-to-list 'face-font-rescale-alist '("Noto" . 1.2))
  (add-to-list 'face-font-rescale-alist '("Symbola" . 1.2))
  (set-fontset-font t 'symbol "Noto Sans CJK SC")
  (set-fontset-font t 'symbol "Symbola" nil 'append)
  (set-fontset-font t 'symbol "Noto Color Emoji" nil 'append)
  (set-fontset-font t 'emoji "Noto Sans CJK SC")
  (set-fontset-font t 'emoji "Symbola" nil 'append)
  (set-fontset-font t 'emoji "Noto Color Emoji" nil 'append))

(when (equal (getenv "container") "flatpak")
  (when galactron-display-enabled-font-setup
    (add-hook 'window-setup-hook 'galactron-display--font-setup-h)))
#+END_SRC

修正俄语字符和拼音中的非英文字符宽度

#+BEGIN_SRC emacs-lisp
(defun galactron-display--set-char-width (alist)
  (let ((table (make-char-table nil)))
    (dolist (pair alist)
      (set-char-table-range table (car pair) (cdr pair)))
    (optimize-char-table table)
    (set-char-table-parent table char-width-table)
    (setq char-width-table table)))

(when galactron-display-enabled-font-setup
  (galactron-display--set-char-width
   '(((?Ё . ?ё) . 1)
     (?№ . 1)
     (?ü . 1)
     (?‘ . 1)
     (?’ . 1)
     (?“ . 1)
     (?” . 1)
     (?’ . 1))))
#+END_SRC

**** [[help:galactron-display-enabled-imenu][IMenu]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-imenu t
  "Imenu"
  :type 'boolean
  :tag "Imenu")

(defun galactron-display--enable-imenu-h ()
  (ignore-errors
    (imenu-add-to-menubar "Imenu")))

(when galactron-display-enabled-imenu
  (dolist (hook
           '(font-lock-mode-hook))
    (add-hook hook 'galactron-display--enable-imenu-h)))
#+END_SRC

**** [[help:galactron-display-enabled-appt][Appointments]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-display-enabled-appt t
  "Appointments"
  :type 'boolean
  :tag "Appointments")

(defvar galactron-display--appt-notification-id nil)

(defun galactron-display--appt-delete ()
  (require 'notifications)
  (when galactron-display--appt-notification-id
    (notifications-close-notification
     galactron-display--appt-notification-id)))

(defun galactron-display--appt-disp (min-to-app new-time appt-msg)
  (require 'notifications)
  (let ((title
         (and (string-match "[0-9:\-]+\s+\\([^:]+\\)" appt-msg)
              (match-string 1 appt-msg))))
    (setq galactron-display--appt-notification-id
          (notifications-notify
           :title title
           :body appt-msg
           :replace-id galactron-display--appt-notification-id
           :timeout (* 60000 (string-to-number min-to-app))))))

(when galactron-display-enabled-appt
  (galactron-default appt-display-diary nil)
  (galactron-default appt-display-mode-line nil)
  (galactron-default appt-disp-window-function
                     'galactron-display--appt-disp)
  (galactron-default appt-delete-window-function
                     'galactron-display--appt-delete)
  (add-hook 'window-setup-hook #'appt-activate))
#+END_SRC

**** [[help:galactron-display-enabled-shortcut-menu][快捷菜单]]
:PROPERTIES:
:header-args:emacs-lisp: :lexical yes :tangle galactron-shortcut.el
:VISIBILITY: children
:END:

#+BEGIN_SRC emacs-lisp :tangle galactron-display.el
(defcustom galactron-display-enabled-shortcut-menu t
  "快捷菜单"
  :type 'boolean
  :tag "Shortcut Menu")

(when galactron-display-enabled-shortcut-menu
  (require 'galactron-shortcut)
  (keymap-set
   (keymap-lookup (current-global-map) "<menu-bar>")
   "<galactron-shortcut-menu>"
   (cons "快捷菜单" galactron-shortcut-menu))
  (add-to-list 'menu-bar-final-items
               'galactron-shortcut-menu 'append))
#+END_SRC

#+BEGIN_SRC emacs-lisp :noweb yes :comments no
<<header(name="galactron-shortcut",desc="快捷菜单")>>
#+END_SRC

#+BEGIN_SRC emacs-lisp
(defvar galactron-shortcut-menu
  (make-sparse-keymap "Galactron Shortcut"))

;;;###autoload
(defun galactron-shortcut-add-item (key name binding &rest plist)
  (funcall
   (if (keymap-lookup galactron-shortcut-menu key)
       'keymap-set
     'keymap-set-after)
   galactron-shortcut-menu
   key
   (apply 'list 'menu-item name binding plist)))

;;;###autoload
(defun galactron-shortcut-add-separator (key)
  (galactron-shortcut-add-item key
                            "--" 'ignore
                            :enable nil))
#+END_SRC

#+BEGIN_SRC emacs-lisp :noweb yes :comments no
<<footer(name="galactron-shortcut")>>
#+END_SRC

