README.org
*** [[help:galactron-accessories-enabled-reminder][启动退出提醒]]
#+BEGIN_SRC emacs-lisp
(defcustom galactron-accessories-enabled-reminder t
  "启动退出提醒"
  :type 'boolean
  :tag "Reminder")

(defcustom galactron-accessories-reminder-hook nil
  "启动退出Emacs时提醒"
  :type 'hook
  :tag "Reminder hook")

(defun galactron-accessories--reminder-run-hooks ()
  (run-hooks 'galactron-accessories-reminder-hook))

(defun galactron-accessories--reminder-confirm-kill (prompt)
  (galactron-accessories--reminder-run-hooks)
  (yes-or-no-p prompt))

(when galactron-accessories-enabled-reminder
  (add-hook 'window-setup-hook
            'galactron-accessories--reminder-run-hooks)
  (galactron-default confirm-kill-emacs
                  'galactron-accessories--reminder-confirm-kill))
#+END_SRC

*** [[help:galactron-accessories-enabled-sticker][便利贴]]
#+BEGIN_SRC emacs-lisp
(defcustom galactron-accessories-enabled-sticker t
  "便利贴"
  :type 'boolean
  :tag "Sticker")

(defcustom galactron-accessories-sticker-functions nil
  "返回Sticker Buffer"
  :type '(repeat function)
  :tag "Sticker functions")

(defun galactron-accessories-sticker-toggle (&optional arg)
  (interactive "P")
  (when galactron-accessories-sticker-functions
    (let ((has-side-window (window-with-parameter 'window-side nil)))
      (when has-side-window
        (window-toggle-side-windows))
      (when (or arg (not has-side-window))
        (seq-map-indexed
         (lambda (f i)
           (with-selected-window
               (display-buffer-in-side-window
                (get-scratch-buffer-create)
                `((side . top) (slot . ,i) (dedicated . t)))
             (with-window-non-dedicated nil
               (funcall f))
             (selected-window)))
         galactron-accessories-sticker-functions)))))

(defun galactron-accessories--sticker-show ()
  (galactron-accessories-sticker-toggle t))

(when galactron-accessories-enabled-sticker
  (add-hook 'galactron-accessories-reminder-hook
            'galactron-accessories--sticker-show)
  (keymap-global-set "C-`" 'galactron-accessories-sticker-toggle))
#+END_SRC

**** [[help:galactron-accessories-enabled-sticker-remember][Remember]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-accessories-enabled-sticker-remember t
  "Remember便利贴"
  :type 'boolean
  :tag "Remember Sticker")

(defun galactron-accessories--sticker--remember ()
  (remember-notes t))

(when galactron-accessories-enabled-sticker-remember
  (when galactron-org-enabled-remember
    (galactron-default-member
     galactron-accessories-sticker-functions
     'galactron-accessories--sticker--remember)))
#+END_SRC

**** [[help:galactron-accessories-enabled-sticker-diary][日程表]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-accessories-enabled-sticker-diary t
  "日程表 便利贴"
  :type 'boolean
  :tag "Diary Sticker")

(defcustom galactron-accessories-sticker-diary-buffer-name
  "*Org Diary*"
  "Diary buffer name"
  :type 'string
  :tag "Diary buffer name")

(defun galactron-accessories--sticker--diary ()
  (let ((org-agenda-buffer-name
         galactron-accessories-sticker-diary-buffer-name))
    (galactron-agenda-diary))
  (goto-char (point-min))
  (when (text-property-search-forward 'face 'org-agenda-current-time)
    (recenter)))

(when galactron-accessories-enabled-sticker-diary
  (when galactron-agenda-enabled-diary
    (galactron-default-member
     galactron-accessories-sticker-functions
     'galactron-accessories--sticker--diary)))
#+END_SRC

**** [[help:galactron-accessories-enabled-sticker-dashboard][Dashboard]]

#+BEGIN_SRC emacs-lisp
(defcustom galactron-accessories-enabled-sticker-dashboard t
  "Dashboard便利贴"
  :type 'boolean
  :tag "Dashboard Sticker")

(defcustom galactron-accessories-sticker-dashboard-buffer-name
  "*Org Dashboard*"
  "Dashboard buffer name"
  :type 'string
  :tag "Dashboard buffer name")

(defun galactron-accessories--sticker--dashboard ()
  (let ((org-agenda-buffer-name
         galactron-accessories-sticker-dashboard-buffer-name))
    (galactron-agenda-dashboard))
  (when (org-clocking-p)
    (unless (eq org-agenda-show-log 'clockcheck)
      (save-excursion
        (goto-char (point-min))
        (org-agenda-update-agenda-type)
        (org-agenda-log-mode 'clockcheck)))))

(when galactron-accessories-enabled-sticker-dashboard
  (when galactron-agenda-enabled-dashboard
    (galactron-default-member
     galactron-accessories-sticker-functions
     'galactron-accessories--sticker--dashboard)))
#+END_SRC

* 深入Galactron
:PROPERTIES:
:header-args:emacs-lisp: :lexical yes :tangle galactron.el
:VISIBILITY: content
:END:
** 自制配置文件
:PROPERTIES:
:VISIBILITY: children
:END:

使用Org-Babel可以在Org文件里写配置。对于能立即生效的配置，修改好配置后，直接在代码块里 ~C-c C-c~ ，避免每次都要重启Emacs。

*** 添加到[[help:galactron-init-files][galactron-init-files]]

在加载Galactron内置配置文件之前，Galactron首先会加载[[help:galactron-init-files][galactron-init-files]]里的文件。

#+BEGIN_SRC emacs-lisp
(defcustom galactron-init-files nil
  "Galactron最先加载的配置文件(会比Galactron自带的配置文件先加载)"
  :type '(repeat (file :must-match t))
  :group 'galactron)
#+END_SRC

建议只加一个文件，在这个文件里用 ~galactron-load-file~ 加载其他配置文件，这些会在Galactron自带配置文件加载完成之后再加载。

#+BEGIN_SRC emacs-lisp
(defvar galactron--init-files nil)
(setq galactron--init-files (copy-sequence galactron-init-files))

(defmacro galactron-load-file (file-name)
  (let ((full-name
         (expand-file-name file-name
                           (file-name-directory
                            (or byte-compile-dest-file
                                load-file-name)))))
    `(unless (member ,full-name galactron--init-files)
       (if galactron--init-files
           (setcdr (last galactron--init-files) (list ,full-name))
         (setq galactron--init-files (list ,full-name))))))
#+END_SRC

*** 修改Emacs默认设置

使用 ~galactron-default*~ 修改设置时，不会影响Custom功能，只要在Custom里保存了自己的设置（要保留默认配置就Add Comment），下次启动Galactron中的配置就不会生效

#+BEGIN_SRC emacs-lisp
(defun galactron--variable-saved-p (symbol)
  (or (get symbol 'saved-value)
      (get symbol 'saved-variable-comment)))
#+END_SRC

要修改单一值可以用 ~galactron-default~

#+BEGIN_SRC emacs-lisp
(defun galactron--default (symbol value)
  (unless (galactron--variable-saved-p symbol)
    (customize-set-variable symbol value)))

(defmacro galactron-default (symbol value)
  `(galactron--default ',symbol ,value))
#+END_SRC

要往List里加一项，可以用 ~galactron-default-member~

#+BEGIN_SRC emacs-lisp
(defun galactron--default-member (symbol value)
  (unless (or (galactron--variable-saved-p symbol)
              (member value (symbol-value symbol)))
    (customize-set-variable symbol
                            (append (symbol-value symbol)
                                    (list value)))))

(defmacro galactron-default-member (symbol value)
  `(galactron--default-member ',symbol ,value))
#+END_SRC

要往Assoc List里加一项，可以用 ~galactron-default-assoc~

#+BEGIN_SRC emacs-lisp
(defun galactron--default-assoc (symbol key value)
  (unless (or (galactron--variable-saved-p symbol)
              (equal (cons key value)
                     (assoc key (symbol-value symbol))))
     (customize-set-variable
      symbol
      (append (assoc-delete-all key
                                (copy-alist (symbol-value symbol)))
              (list (cons key value))))))

(defmacro galactron-default-assoc (symbol key value)
  `(galactron--default-assoc ',symbol ,key ,value))
#+END_SRC

对于可以动态调整的配置，可以用 ~:set 'galactron-set-default-value~

#+BEGIN_SRC emacs-lisp
(defun galactron-set-default-value (symbol value)
  (unless (and (boundp symbol)
               (eq (symbol-value symbol) value))
    (set-default-toplevel-value symbol value)
    (funcall
     (intern (string-replace "-enabled-" "-set-enabled-"
                             (symbol-name symbol)))
     value)))
#+END_SRC

*** 延迟加载

为了避免拖慢Emacs启动，对于一个具体的模块，可以用[[help:with-eval-after-load][with-eval-after-load]]。对于一个包，用[[help:galactron-with-package-installed][galactron-with-package-installed]]

#+BEGIN_SRC emacs-lisp
(defmacro galactron--with-messages (&rest body)
  (declare (indent 0) (debug (form body)))
  `(with-current-buffer (get-buffer "*Messages*")
     (save-excursion
       (goto-char (point-max))
       (let ((inhibit-read-only t))
         (unless (zerop (current-column)) (insert "\n"))
         ,@body))))

(defun galactron--package-install (package)
  (interactive)
  (when (yes-or-no-p
         (format "Do you want to install '%s' now?" package))
    (package-install package)))

(defun galactron--find-location (location)
  (when (file-exists-p (car location))
    (find-file (car location))
    (goto-char (cdr location))))

(defmacro galactron-when-package-installed (package &rest body)
  (declare (indent 1) (debug (form body)))
  (let ((autoloads (intern (format "%s-autoloads" package))))
    `(with-eval-after-load ',autoloads
       ,@body)))

(defmacro galactron-with-package-installed (package &rest body)
  (declare (indent 1) (debug (form body)))
  (let ((file (or byte-compile-current-file load-file-name))
        (pos (with-current-buffer
                 (or byte-compile-current-buffer
                     (car eval-buffer-list))
             (save-excursion
               (backward-list)
               (point)))))
    `(progn
       (unless (package-installed-p ',package)
         (galactron--with-messages
           (insert
            (concat
             "由于未"
             (buttonize (format "安装%S" ',package)
                        'galactron--package-install ',package)
             "，部分配置未生效，"
             (buttonize "查看详情" 'galactron--find-location
                        (cons ,file ,pos))
             "\n"))))
       (galactron-when-package-installed ,package ,@body))))
#+END_SRC

** 启动过程
:PROPERTIES:
:VISIBILITY: children
:END:
