galactron.el
;; [[file:README.org::*添加到\[\[help:galactron-init-files\]\[galactron-init-files\]\]][添加到[[help:galactron-init-files][galactron-init-files]]:1]]
(defcustom galactron-init-files nil
  "Galactron最先加载的配置文件(会比Galactron自带的配置文件先加载)"
  :type '(repeat (file :must-match t))
  :group 'galactron)
;; 添加到[[help:galactron-init-files][galactron-init-files]]:1 ends here
;; [[file:README.org::*添加到\[\[help:galactron-init-files\]\[galactron-init-files\]\]][添加到[[help:galactron-init-files][galactron-init-files]]:2]]
(defvar galactron--init-files nil)
(setq galactron--init-files (copy-sequence galactron-init-files))

(defmacro galactron-load-file (file-name)
  (let ((full-name
         (expand-file-name file-name
                           (file-name-directory
                            (or byte-compile-dest-file
                                load-file-name)))))
    `(unless (member ,full-name galactron--init-files)
       (if galactron--init-files
           (setcdr (last galactron--init-files) (list ,full-name))
         (setq galactron--init-files (list ,full-name))))))
;; 添加到[[help:galactron-init-files][galactron-init-files]]:2 ends here
;; [[file:README.org::*修改Emacs默认设置][修改Emacs默认设置:1]]
(defun galactron--variable-saved-p (symbol)
  (or (get symbol 'saved-value)
      (get symbol 'saved-variable-comment)))
;; 修改Emacs默认设置:1 ends here
;; [[file:README.org::*修改Emacs默认设置][修改Emacs默认设置:2]]
(defun galactron--default (symbol value)
  (unless (galactron--variable-saved-p symbol)
    (customize-set-variable symbol value)))

(defmacro galactron-default (symbol value)
  `(galactron--default ',symbol ,value))
;; 修改Emacs默认设置:2 ends here
;; [[file:README.org::*修改Emacs默认设置][修改Emacs默认设置:3]]
(defun galactron--default-member (symbol value)
  (unless (or (galactron--variable-saved-p symbol)
              (member value (symbol-value symbol)))
    (customize-set-variable symbol
                            (append (symbol-value symbol)
                                    (list value)))))

(defmacro galactron-default-member (symbol value)
  `(galactron--default-member ',symbol ,value))
;; 修改Emacs默认设置:3 ends here
;; [[file:README.org::*修改Emacs默认设置][修改Emacs默认设置:4]]
(defun galactron--default-assoc (symbol key value)
  (unless (or (galactron--variable-saved-p symbol)
              (equal (cons key value)
                     (assoc key (symbol-value symbol))))
     (customize-set-variable
      symbol
      (append (assoc-delete-all key
                                (copy-alist (symbol-value symbol)))
              (list (cons key value))))))

(defmacro galactron-default-assoc (symbol key value)
  `(galactron--default-assoc ',symbol ,key ,value))
;; 修改Emacs默认设置:4 ends here
;; [[file:README.org::*修改Emacs默认设置][修改Emacs默认设置:5]]
(defun galactron-set-default-value (symbol value)
  (unless (and (boundp symbol)
               (eq (symbol-value symbol) value))
    (set-default-toplevel-value symbol value)
    (funcall
     (intern (string-replace "-enabled-" "-set-enabled-"
                             (symbol-name symbol)))
     value)))
;; 修改Emacs默认设置:5 ends here
;; [[file:README.org::*延迟加载][延迟加载:1]]
(defmacro galactron--with-messages (&rest body)
  (declare (indent 0) (debug (form body)))
  `(with-current-buffer (get-buffer "*Messages*")
     (save-excursion
       (goto-char (point-max))
       (let ((inhibit-read-only t))
         (unless (zerop (current-column)) (insert "\n"))
         ,@body))))

(defun galactron--package-install (package)
  (interactive)
  (when (yes-or-no-p
         (format "Do you want to install '%s' now?" package))
    (package-install package)))

(defun galactron--find-location (location)
  (when (file-exists-p (car location))
    (find-file (car location))
    (goto-char (cdr location))))

(defmacro galactron-when-package-installed (package &rest body)
  (declare (indent 1) (debug (form body)))
  (let ((autoloads (intern (format "%s-autoloads" package))))
    `(with-eval-after-load ',autoloads
       ,@body)))

(defmacro galactron-with-package-installed (package &rest body)
  (declare (indent 1) (debug (form body)))
  (let ((file (or byte-compile-current-file load-file-name))
        (pos (with-current-buffer
                 (or byte-compile-current-buffer
                     (car eval-buffer-list))
             (save-excursion
               (backward-list)
               (point)))))
    `(progn
       (unless (package-installed-p ',package)
         (galactron--with-messages
           (insert
            (concat
             "由于未"
             (buttonize (format "安装%S" ',package)
                        'galactron--package-install ',package)
             "，部分配置未生效，"
             (buttonize "查看详情" 'galactron--find-location
                        (cons ,file ,pos))
             "\n"))))
       (galactron-when-package-installed ,package ,@body))))
;; 延迟加载:1 ends here
