galactron.el
;; [[file:README.org::*设置 ~after-init-hook~][设置 ~after-init-hook~:1]]
;;;###autoload(add-hook 'after-init-hook 'galactron--first-h -100)
;;;###autoload(add-hook 'after-init-hook 'galactron--last-h 100)
;; 设置 ~after-init-hook~:1 ends here
;; [[file:README.org::*设置 ~after-init-hook~][设置 ~after-init-hook~:2]]
(defun galactron--check-after-init ()
  (cond
   ((not after-init-time)
    (lwarn 'galactron :error "called before `after-init-hook'")
    nil)
   ((and
     (eq (car after-init-hook) 'galactron--first-h)
     (eq (car (last after-init-hook)) 'galactron--last-h))
    t)
   (t
    (lwarn 'galactron :error "bad `after-init-hook'")
    nil)))
;; 设置 ~after-init-hook~:2 ends here
;; [[file:README.org::*设置 ~after-init-hook~][设置 ~after-init-hook~:3]]
(defvar galactron--before-init-time nil)
(defvar galactron--first-h-finished nil)

;;;###autoload
(defun galactron--first-h ()
  (if galactron--before-init-time
      (lwarn 'galactron
             :warning "`galactron--first-h' called twice")
    (setq galactron--before-init-time (current-time))
    (when (galactron--check-after-init)
      (let ((result :error))
        (unwind-protect
            (progn
              (galactron--load-init-files)
              (galactron--restore-bars)
              (setq result t))
          (setq galactron--first-h-finished result))))))
;; 设置 ~after-init-hook~:3 ends here
;; [[file:README.org::*设置 ~after-init-hook~][设置 ~after-init-hook~:4]]
(defvar galactron--last-h-started nil)
(defvar galactron--after-init-time nil)
(defvar galactron--load-time nil)

;;;###autoload
(defun galactron--last-h ()
  (if galactron--last-h-started
      (lwarn 'galactron :warning "`galactron--last-h' called twice")
    (setq galactron--last-h-started t)
    (cond
     ((not galactron--before-init-time)
      (lwarn
       'galactron
       :error
       "`galactron--last-h' called before `galactron--first-h'"))
     ((not galactron--first-h-finished)
      (lwarn
       'galactron
       :error "`galactron--last-h' called in `galactron--first-h'"))
     ((not (eq galactron--first-h-finished t))
      (lwarn 'galactron :error "`galactron--first-h' failed"))
     ((galactron--check-after-init)
      (setq galactron--after-init-time (current-time))
      (push (cons
             (float-time (time-subtract after-init-time
                                        before-init-time))
             "emacs-init-time")
            galactron--load-time)
      (galactron--record-time "after-init-hook"
                              galactron--before-init-time)
      (galactron--record-time "" before-init-time)
      (message "time   config-file-name")
      (let ((pkg-dir
             (package-desc-dir (cadr (assq 'galactron
                                           package-alist)))))
        (pcase-dolist (`(,time . ,file-name)
                       (seq-sort-by 'car '> galactron--load-time))
          (message
           "%.04f %s" time
           (cond
            ((galactron--org-file-p file-name)
             (file-relative-name file-name org-directory))
            ((file-name-absolute-p file-name)
             (file-relative-name file-name pkg-dir))
            (t
             file-name)))))))))
;; 设置 ~after-init-hook~:4 ends here
;; [[file:README.org::*设置 ~window-setup-hook~][设置 ~window-setup-hook~:1]]
;;;###autoload(add-hook 'window-setup-hook 'galactron--start-time-h 100)

(defun galactron--start-time-h ()
  (message "emacs took more than %s seconds to start"
           (float-time (time-since before-init-time))))
;; 设置 ~window-setup-hook~:1 ends here
;; [[file:README.org::*跳过Menu/Tab/Tool Bar][跳过Menu/Tab/Tool Bar:1]]
;;;###autoload(setq emacs-basic-display t)
;; 跳过Menu/Tab/Tool Bar:1 ends here
;; [[file:README.org::*加载配置文件][加载配置文件:1]]
(defun galactron--load-init-files ()
  (dolist (file-name galactron--init-files)
    (let ((start-time (current-time)))
      (galactron--load-file file-name)
      (galactron--record-time file-name start-time)))
  (galactron--record-time "galactron" galactron--before-init-time))
;; 加载配置文件:1 ends here
;; [[file:README.org::*加载配置文件][加载配置文件:2]]
(defun galactron--record-time (file-name time)
  (push (cons (float-time (time-since time)) file-name)
        galactron--load-time))
;; 加载配置文件:2 ends here
;; [[file:README.org::*加载配置文件][加载配置文件:3]]
(defun galactron--org-file-p (file-name)
  (provided-mode-derived-p
   (assoc-default file-name auto-mode-alist 'string-match-p)
   'org-mode))

(defun galactron--load-file (file-name)
  (if (galactron--org-file-p file-name)
      (let ((tangled (file-name-with-extension file-name ".el")))
        (if (file-newer-than-file-p file-name tangled)
            (org-babel-load-file file-name)
          (load-file tangled)))
    (load file-name)))
;; 加载配置文件:3 ends here
;; [[file:README.org::*加载内置配置文件][加载内置配置文件:1]]
(when galactron-group-enabled-server
  (galactron-load-file "galactron-server"))

(when galactron-group-enabled-package
  (galactron-load-file "galactron-package"))

(when galactron-group-enabled-display
  (galactron-load-file "galactron-display"))

(when galactron-group-enabled-edit
  (galactron-load-file "galactron-edit"))

(when galactron-group-enabled-frame
  (galactron-load-file "galactron-frame"))

(when galactron-group-enabled-org
  (galactron-load-file "galactron-org"))

(when galactron-group-enabled-pdf
  (galactron-with-package-installed pdf-tools
    (galactron-load-file "galactron-pdf")))

(when galactron-group-enabled-nov
  (galactron-with-package-installed nov
    (galactron-load-file "galactron-nov")))

(when galactron-group-enabled-ssp
  (galactron-with-package-installed ssp
    (galactron-load-file "galactron-ssp")))

(when galactron-group-enabled-largefile
  (galactron-with-package-installed largefile
    (galactron-load-file "galactron-largefile")))

(when galactron-group-enabled-wanderlust
  (galactron-with-package-installed wanderlust
    (galactron-load-file "galactron-wanderlust")))

(when galactron-group-enabled-flatpak
  (galactron-load-file "galactron-flatpak"))

(when galactron-group-enabled-capture
  (galactron-with-package-installed orb
    (galactron-load-file "galactron-capture")))

(when galactron-group-enabled-agenda
  (galactron-load-file "galactron-agenda"))

(when galactron-group-enabled-orb
  (galactron-with-package-installed orb
    (galactron-load-file "galactron-orb")))

(when galactron-group-enabled-accessories
  (galactron-load-file "galactron-accessories"))
;; 加载内置配置文件:1 ends here
;; [[file:README.org::*恢复Menu/Tab/Tool Bar][恢复Menu/Tab/Tool Bar:1]]
(defun galactron--restore-bars ()
  (when (galactron--variable-reset-value menu-bar-mode)
    (push (cons 'menu-bar-lines 1) default-frame-alist))
  (when (galactron--variable-reset-value tab-bar-mode)
    (push (cons 'tab-bar-lines 1) default-frame-alist))
  (when (galactron--variable-reset-value tool-bar-mode)
    (push (cons 'tool-bar-lines 1) default-frame-alist)))
;; 恢复Menu/Tab/Tool Bar:1 ends here
;; [[file:README.org::*恢复Menu/Tab/Tool Bar][恢复Menu/Tab/Tool Bar:2]]
(defun galactron--variable-get-think-value (symbol)
  (cond
   ((get symbol 'customized-value)
    (eval (car (get symbol 'customized-value))))
   ((get symbol 'customized-variable-comment)
    nil)
   ((get symbol 'saved-value)
    (eval (car (get symbol 'saved-value))))
   ((get symbol 'saved-variabled-comment)
    nil)
   (t
    (eval (car (get symbol 'standard-value))))))

(defmacro galactron--variable-reset-value (symbol)
  (let ((think-var (gensym)))
    `(let ((,think-var (galactron--variable-get-think-value ',symbol)))
       (unless (equal ,think-var ,symbol)
         (setq ,symbol ,think-var)))))
;; 恢复Menu/Tab/Tool Bar:2 ends here
(provide 'galactron)
;;; galactron.el ends here
